# IsActive Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AppearanceAssetEditScope..::..IsActive Property
AppearanceAssetEditScope Class See Also
---
Identifies if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public bool IsActive { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsActive As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsActive {
	bool get ();
}
```

# Remarks
Starting the edit scope is not permitted when it is active. Canceling/committing is not allowed when the edit scope is not active.
# See Also
AppearanceAssetEditScope Class
Autodesk.Revit.DB.Visual Namespace